In [1]:
import numpy as np
import pandas as pd

In [2]:
dict_={"Names":['John','Riya','Shila','Jockey','Alisha'],
       "Age":[21,20,120,23,21]}
df=pd.DataFrame(dict_)
df

    Names  Age
0    John   21
1    Riya   20
2   Shila  120
3  Jockey   23
4  Alisha   21

In [3]:
df['Names'].values

array(['John', 'Riya', 'Shila', 'Jockey', 'Alisha'], dtype=object)

In [4]:
## to remove the spaces
df["Names"] = df["Names"].str.strip()
print(df["Names"].values)

['John' 'Riya' 'Shila' 'Jockey' 'Alisha']

In [5]:
## convert all character to upper case
df['Names'].str.upper()

0      JOHN
1      RIYA
2     SHILA
3    JOCKEY
4    ALISHA
Name: Names, dtype: object

In [6]:
## convert all character to lower case
df['Names'].str.lower()

0      john
1      riya
2     shila
3    jockey
4    alisha
Name: Names, dtype: object

In [7]:
## capitalize each word
df["Names"]=[x.capitalize() for x in df['Names']]
print(df["Names"])

0      John
1      Riya
2     Shila
3    Jockey
4    Alisha
Name: Names, dtype: object

In [8]:
dff=pd.read_csv('diabetes.csv')

In [9]:
## Binning
df_cut=pd.cut(dff["BMI"], bins=np.arange(0, 75, step=5),right=False) ## without label

In [10]:
df_cut_label=pd.cut(dff["BMI"], bins=np.arange(0,75,step=5), labels=range(14), right=False) ## with label

In [11]:
df_cut=pd.DataFrame(df_cut)
df_cut_label=pd.DataFrame(df_cut_label)

In [12]:
display("df_cut.head()")
print(df_cut.head())
display("df_cut_label.head()")
print(df_cut_label.head())

'df_cut.head()'

        BMI
0  [30, 35)
1  [25, 30)
2  [20, 25)
3  [25, 30)
4  [40, 45)

'df_cut_label.head()'

  BMI
0   6
1   5
2   4
3   5
4   8

In [13]:
df=df[df["Age"]<100]
df

    Names  Age
0    John   21
1    Riya   20
3  Jockey   23
4  Alisha   21

In [14]:
## Reset index
df.reset_index(drop=True)

    Names  Age
0    John   21
1    Riya   20
2  Jockey   23
3  Alisha   21

In [15]:
## Reindex
index_ = np.arange(0, 6, step=1)
df.reindex(index=index_)

    Names   Age
0    John  21.0
1    Riya  20.0
2     NaN   NaN
3  Jockey  23.0
4  Alisha  21.0
5     NaN   NaN

In [16]:
df.reindex(index=index_, fill_value=0)

    Names  Age
0    John   21
1    Riya   20
2       0    0
3  Jockey   23
4  Alisha   21
5       0    0

In [17]:
## Set index
df.set_index('Age').head(3)

      Names
Age
21     John
20     Riya
23   Jockey

In [18]:
df.set_index('Names').head(3)

        Age
Names
John     21
Riya     20
Jockey   23

In [19]:
## Sort on index
df.sort_index(ascending=False)

    Names  Age
4  Alisha   21
3  Jockey   23
1    Riya   20
0    John   21

In [20]:
df.sort_values(by='Age', ascending=True)

    Names  Age
1    Riya   20
0    John   21
4  Alisha   21
3  Jockey   23

In [21]:
## Change Data types
df['Age'].astype(str)

0    21
1    20
3    23
4    21
Name: Age, dtype: object

In [22]:
df = df.astype({"Age": "category", "Names": str})
df.head(3)

    Names Age
0    John  21
1    Riya  20
3  Jockey  23

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   4 non-null      object
 1   Age     4 non-null      category
dtypes: category(1), object(1)
memory usage: 332.0+ bytes

In [24]:
## Shifting values

In [25]:
df['Age'].shift(1)

0    NaN
1     21
3     20
4     23
Name: Age, dtype: category
Categories (3, int64): [20, 21, 23]

In [26]:
df['Age'].shift(-1)

0     20
1     23
3     21
4    NaN
Name: Age, dtype: category
Categories (3, int64): [20, 21, 23]

In [27]:
df['Age'] = df['Age'].astype(int) # converting back to int datatype
df['Age'].head()

0    21
1    20
3    23
4    21
Name: Age, dtype: int32

In [28]:
# replace values
df['Age'].replace(20, 45)

0    21
1    45
3    23
4    21
Name: Age, dtype: int32

In [29]:
## Rename columns index
df.rename(columns = {"Names": "Des noms"})

  Des noms  Age
0     John   21
1     Riya   20
3   Jockey   23
4   Alisha   21

In [30]:
df.columns = ["Age", "Names"]
df.head(3)

      Age  Names
0    John     21
1    Riya     20
3  Jockey     23